Revit 2027 API
Document.Settings Property
Provides access to general application settings, such as Categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Settings Settings { get; }
Public ReadOnly Property Settings As Settings
	Get
public:
property Settings^ Settings {
	Settings^ get ();
}
member Settings : Settings with get
Property Value
Settings
Remarks
Returns an object that provides access to various settings within Autodesk Revit. The Settings property returns an object that provides access to the categories within the Autodesk Revit project.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace